#include QMK_KEYBOARD_H

// レイヤーの名前を定義。
enum layer_names {
    _BASE,
    _RAISE,
};

// カスタムキーコードはここに定義。挙動は、process_record_user関数で実装。
enum custom_keycodes {
    CK_LSFT = SAFE_RANGE,
    CK_RSFT
};

// 各レイヤーごとのキー配置を定義。
// 使用可能なキーコードの一覧は以下。
// https://docs.qmk.fm/#/ja/keycodes
const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {

  /* Base (デフォルトの状態)
   * ,--------------------------------------------------.                    ,--------------------------------------------------.
   * |  ESC |   1  |   2  |   3  |    4   |   5  |  F5  |                    |  F2  |   6  |    7   |   8  |   9  |   0  |  -   |
   * |------+------+------+------+--------+------+------|                    |------+------+--------+------+------+------+------|
   * |  Tab |   q  |   w  |   e  |    r   |   t  |  F6  |                    |  F12 |   y  |    u   |   i  |   o  |   p  |  @   |
   * |------+------+------+------+--------+------+------|                    |------+------+--------+------+------+------+------|
   * | PRSC |   a  |   s  |   d  |    f   |   g  |  F8  |                    |   ^  |   h  |    j   |   k  |   l  |   ;  |  :   |
   * |------+------+------+------+--------+------+------+------.      ,------+------+------+--------+------+------+------+------|
   * | CTRL |   z  |   x  |   c  |    v   |   b  |      |CLPHST|      |絵文字|      |   n  |    m   |   ,  |   .  |   /  |  \   |
   * |-------------+------+------+--------+------|      |------|      ,------|      |------+--------+------+------+------+------|
   * |  GUI |Insert|  DEL ||||||||Alt/MHEN| SHIFT| Space| RAISE|      | RAISE| Enter| SHIFT|Alt/HENK||||||||   [  |  ]   |  ￥  |
   * ,---------------------------------------------------------.      ,---------------------------------------------------------.
   */
  [_BASE] = LAYOUT(
     KC_ESC , KC_1   , KC_2  , KC_3  , KC_4           , KC_5   , KC_F5                                    , KC_F2  , KC_6   , KC_7           , KC_8    , KC_9   , KC_0   , KC_MINS, \
     KC_TAB , KC_Q   , KC_W  , KC_E  , KC_R           , KC_T   , KC_F6                                    , KC_F12 , KC_Y   , KC_U           , KC_I    , KC_O   , KC_P   , KC_LBRC, \
     KC_PSCR, KC_A   , KC_S  , KC_D  , KC_F           , KC_G   , KC_F8                                    , KC_EQL , KC_H   , KC_J           , KC_K    , KC_L   , KC_SCLN, KC_QUOT, \
     KC_LCTL, KC_Z   , KC_X  , KC_C  , KC_V           , KC_B            , G(KC_V)            , G(KC_DOT)           , KC_N   , KC_M           , KC_COMM , KC_DOT , KC_SLSH, KC_RO  , \
     KC_LGUI, KC_INS , KC_DEL        , LALT_T(KC_MHEN), KC_LSFT, KC_SPC , MO(_RAISE)         , MO(_RAISE) , KC_ENT , KC_RSFT, RALT_T(KC_HENK)          , KC_RBRC, KC_NUHS, KC_JYEN  \
  ),
  /* RAISE layer(E=MC^2 を押しながら対象のキーを押す)
   * ,------------------------------------------------.                    ,------------------------------------------------.
   * |  F11 |  F1  |  F2  |  F3  |  F4  |  F5  | Pause|                    |      |  F6  |  F7  |  F8  |  F9  |  F10 |  F12 |
   * |------+------+------+------+------+------+------|                    |------+------+------+------+------+------+------|
   * | 全/半|      |      |      |      |      |SCR_LK|                    |      | Home | PgDw | PgUp |  End |      |      |
   * |------+------+------+------+------+------+------|                    |------+------+------+------+------+------+------|
   * | CAPS |      |      |      |      |      | KANA |                    |      | Left | Down |  Up  | Right|      |      |
   * |------+------+------+------+------+------+------+------.      ,------+------+------+------+------+------+------+------|
   * |      |      |      |      |      |      |      |      |      |      |      |   {  |   }  |   [  |   ]  |      |   |  |
   * |-------------+------+------+------+------|      |------|      |------|      |------+------+------+------+------+------|
   * | Menu |      |      ||||||||      |      |      |      |      |      | BSPC |      |      ||||||||      |      |      |
   * ,-------------------------------------------------------.      ,-------------------------------------------------------.
   */
  [_RAISE] = LAYOUT(
    KC_F11 , KC_F1  , KC_F2  , KC_F3  , KC_F4   , KC_F5  , KC_PAUS                          , _______, KC_F6     , KC_F7      , KC_F8  , KC_F9  , KC_F10 , KC_F12    , \
    KC_GRV , _______, _______, _______, _______ , _______, KC_SLCK                          , _______, KC_HOME   , KC_PGDN    , KC_PGUP, KC_END , _______, _______   , \
    KC_CAPS, _______, _______, _______, _______ , _______, KC_KANA                          , _______, KC_LEFT   , KC_DOWN    , KC_UP  , KC_RGHT, _______, _______   , \
    _______, _______, _______, _______, _______ , _______         , _______        , _______         , S(KC_RBRC), S(KC_BSLS) , KC_RBRC, KC_BSLS, _______, S(KC_JYEN), \
    KC_APP , _______, _______         , _______ , _______, _______, _______        , _______, KC_BSPC, _______   , _______             , _______, _______, _______     \
  ),
};


bool process_record_user(uint16_t keycode, keyrecord_t *record) {
    return true;
}

